SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_map.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 MAP register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_MAP_H
#define EFR32FG25_MAP_H
#define MAP_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_MAP MAP
 * @{
 * @brief EFR32FG25 MAP Register Declaration.
 *****************************************************************************/

/** MAP Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< New Register                                       */
  __IOM uint32_t DISCLK;                        /**< Disable Clocks                                     */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN;                         /**< New Register                                       */
  uint32_t       RESERVED3[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT;                        /**< New Register                                       */
  uint32_t       RESERVED4[79U];                /**< Reserved for future use                            */
  __IOM uint32_t CTRL;                          /**< New Register                                       */
  uint32_t       RESERVED5[895U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_SET;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED6[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED7[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED8[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_SET;                     /**< New Register                                       */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_SET;                    /**< New Register                                       */
  uint32_t       RESERVED10[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_SET;                      /**< New Register                                       */
  uint32_t       RESERVED11[895U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED12[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED13[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED14[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_CLR;                     /**< New Register                                       */
  uint32_t       RESERVED15[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED16[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_CLR;                      /**< New Register                                       */
  uint32_t       RESERVED17[895U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable Clocks                                     */
  uint32_t       RESERVED18[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED19[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED20[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_TGL;                     /**< New Register                                       */
  uint32_t       RESERVED21[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED22[79U];               /**< Reserved for future use                            */
  __IOM uint32_t CTRL_TGL;                      /**< New Register                                       */
} MAP_TypeDef;
/** @} End of group EFR32FG25_MAP */

/**************************************************************************//**
 * @addtogroup EFR32FG25_MAP
 * @{
 * @defgroup EFR32FG25_MAP_BitFields MAP Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for MAP IPVERSION */
#define _MAP_IPVERSION_RESETVALUE           0x00000001UL                                /**< Default value for MAP_IPVERSION             */
#define _MAP_IPVERSION_MASK                 0xFFFFFFFFUL                                /**< Mask for MAP_IPVERSION                      */
#define _MAP_IPVERSION_IPVERSION_SHIFT      0                                           /**< Shift value for MAP_IPVERSION               */
#define _MAP_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                                /**< Bit mask for MAP_IPVERSION                  */
#define _MAP_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                                /**< Mode DEFAULT for MAP_IPVERSION              */
#define MAP_IPVERSION_IPVERSION_DEFAULT     (_MAP_IPVERSION_IPVERSION_DEFAULT << 0)     /**< Shifted mode DEFAULT for MAP_IPVERSION      */

/* Bit fields for MAP EN */
#define _MAP_EN_RESETVALUE                  0x00000000UL                                /**< Default value for MAP_EN                    */
#define _MAP_EN_MASK                        0x00000003UL                                /**< Mask for MAP_EN                             */
#define MAP_EN_EN                           (0x1UL << 0)                                /**< Module Enable                               */
#define _MAP_EN_EN_SHIFT                    0                                           /**< Shift value for MAP_EN                      */
#define _MAP_EN_EN_MASK                     0x1UL                                       /**< Bit mask for MAP_EN                         */
#define _MAP_EN_EN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for MAP_EN                     */
#define MAP_EN_EN_DEFAULT                   (_MAP_EN_EN_DEFAULT << 0)                   /**< Shifted mode DEFAULT for MAP_EN             */
#define MAP_EN_DISABLING                    (0x1UL << 1)                                /**< Disablement Busy Status                     */
#define _MAP_EN_DISABLING_SHIFT             1                                           /**< Shift value for MAP_DISABLING               */
#define _MAP_EN_DISABLING_MASK              0x2UL                                       /**< Bit mask for MAP_DISABLING                  */
#define _MAP_EN_DISABLING_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for MAP_EN                     */
#define MAP_EN_DISABLING_DEFAULT            (_MAP_EN_DISABLING_DEFAULT << 1)            /**< Shifted mode DEFAULT for MAP_EN             */

/* Bit fields for MAP SWRST */
#define _MAP_SWRST_RESETVALUE               0x00000000UL                                /**< Default value for MAP_SWRST                 */
#define _MAP_SWRST_MASK                     0x00000003UL                                /**< Mask for MAP_SWRST                          */
#define MAP_SWRST_SWRST                     (0x1UL << 0)                                /**< Software Reset Command                      */
#define _MAP_SWRST_SWRST_SHIFT              0                                           /**< Shift value for MAP_SWRST                   */
#define _MAP_SWRST_SWRST_MASK               0x1UL                                       /**< Bit mask for MAP_SWRST                      */
#define _MAP_SWRST_SWRST_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for MAP_SWRST                  */
#define MAP_SWRST_SWRST_DEFAULT             (_MAP_SWRST_SWRST_DEFAULT << 0)             /**< Shifted mode DEFAULT for MAP_SWRST          */
#define MAP_SWRST_RESETTING                 (0x1UL << 1)                                /**< Software Reset Busy Status                  */
#define _MAP_SWRST_RESETTING_SHIFT          1                                           /**< Shift value for MAP_RESETTING               */
#define _MAP_SWRST_RESETTING_MASK           0x2UL                                       /**< Bit mask for MAP_RESETTING                  */
#define _MAP_SWRST_RESETTING_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for MAP_SWRST                  */
#define MAP_SWRST_RESETTING_DEFAULT         (_MAP_SWRST_RESETTING_DEFAULT << 1)         /**< Shifted mode DEFAULT for MAP_SWRST          */

/* Bit fields for MAP CONNECT */
#define _MAP_CONNECT_RESETVALUE             0x00000000UL                                /**< Default value for MAP_CONNECT               */
#define _MAP_CONNECT_MASK                   0x00000101UL                                /**< Mask for MAP_CONNECT                        */
#define MAP_CONNECT_IN                      (0x1UL << 0)                                /**< Input FIFO connect                          */
#define _MAP_CONNECT_IN_SHIFT               0                                           /**< Shift value for MAP_IN                      */
#define _MAP_CONNECT_IN_MASK                0x1UL                                       /**< Bit mask for MAP_IN                         */
#define _MAP_CONNECT_IN_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for MAP_CONNECT                */
#define MAP_CONNECT_IN_DEFAULT              (_MAP_CONNECT_IN_DEFAULT << 0)              /**< Shifted mode DEFAULT for MAP_CONNECT        */
#define MAP_CONNECT_OUT                     (0x1UL << 8)                                /**< Output FIFO connect                         */
#define _MAP_CONNECT_OUT_SHIFT              8                                           /**< Shift value for MAP_OUT                     */
#define _MAP_CONNECT_OUT_MASK               0x100UL                                     /**< Bit mask for MAP_OUT                        */
#define _MAP_CONNECT_OUT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for MAP_CONNECT                */
#define MAP_CONNECT_OUT_DEFAULT             (_MAP_CONNECT_OUT_DEFAULT << 8)             /**< Shifted mode DEFAULT for MAP_CONNECT        */

